//キャンパスのサイズを指定
size(400,400);

//背景色を指定
//          赤  緑  青
background(128,128,128,0);

//顔のりんかくをかく
 fill(29,181,240);
 ellipse(200,150, 200,200);
 
//顔の白い部分をかく
 fill(255,255,255);
 ellipse(200,165, 170,170);

//目をかく
 ellipse(180,85, 40,40);
 ellipse(220,85, 40,40);
 fill(0,0,0);
 ellipse(185,85, 10,10);
 ellipse(215,85, 10,10);
 fill(255,255,255);
 ellipse(185,85, 5,5);
 ellipse(215,85, 5,5);
 
//鼻をかく
 fill(255,0,0);
 ellipse(200,105, 20,20);
 
//ひげをかく
 strokeWeight(2);
 line(200,115,200,160);
 line(100,80,165,110);
 line(100,125,165,125);
 line(100,155,165,140);
 line(230,110,305,80);
 line(230,125,305,125);
 line(230,140,305,155);

//口をかく
 fill(255,0,0);
 strokeWeight(1);
 arc(200, 150, 120, 120, radians(0), radians(180),CHORD);//円弧をかく
